tutorials/catchyMultiphaseEulerFoam/packedBedValidation/isothermalSegregatedMassTransfer/0.org/T.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.particles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 1098;

boundaryField
{
    inlet
    {
        type               zeroGradient;
    }
    outlet
    {
        type               zeroGradient;
    }
    walls
    {
        type               zeroGradient;
    }
    wedge
    {
        type               wedge;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
