tutorials/catchyMultiphaseEulerFoam/packedBedValidation/isothermalSegregatedMassTransfer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin 	-0.0025;
xmax  	0.0025;
ymin 	-0.0001;
ymax  	0.0001;
zmin 	0.0;
zmax  	0.01;

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 1 100) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 3 2 1)
    )
    patch outlet
    (
        (4 5 6 7)
    )
    wall walls
    (
        (2 6 5 1)
        (0 4 7 3)
    )
    empty frontAndBackPlanes
    (
        (1 5 4 0)
        (3 7 6 2)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
